import React from 'react';

const getColumns = () => {
  return [
    {
      key: 'col1',
      name: '第一列',
      sort: true,
      style: { width: '90px' },
    },
    {
      key: 'test',
      name: '测试',
      sort: false,
      style: { width: '120px' },
    },
    {
      key: 'col2',
      name: '第二列',
      sort: true,
    },
    {
      key: 'operate',
      name: '操作',
      render: (d) => {
        const { kid } = d;
        return <div style={{ color: 'orangered' }}>?kid={kid}</div>;
      },
    },
  ];
};

const getData = () => {
  return [
    { kid: 1, col1: '????????', test: '!!!!!!!', col2: '########' },
    { kid: 2, col1: '????????', test: '!!!!!!!#####################################', col2: '########' },
    { kid: 3, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 9, col1: '????????', test: '!!!!!!', col2: '########' },
    {
      kid: 101,
      col1: '????????',
      test: '计算机网络是利用通信设备和线路将空间位置不同、功能独立的多个 计算机系统 互连起来，以功能完善的 网络软件 实现网络中资源共享和信息传递的系统（互连的自治的的计算机系统集合）',
      col2: '########',
    },
    { kid: 102, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 103, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 109, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 11, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 12, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 13, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 19, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 21, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 22, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 23, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 29, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 30, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 31, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 32, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 33, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 34, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 35, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 36, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 37, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 38, col1: '????????', test: '!!!!!!', col2: '########' },
    { kid: 39, col1: '????????', test: '!!!!!!', col2: '########' },
  ];
};

export default { getColumns, getData };
